<a href="https://colab.research.google.com/github/SMeghanaa/DATA-SCIENCE/blob/master/Assignment10(6_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
df=pd.read_csv("https://raw.githubusercontent.com/kotagiri-preeti/Summer-Internship-AI-and-ML/master/german_credit_data.csv",nrows=10)
df

   Unnamed: 0  Age     Sex  ...  Credit amount Duration              Purpose
0           0   67    male  ...           1169        6             radio/TV
1           1   22  female  ...           5951       48             radio/TV
2           2   49    male  ...           2096       12            education
3           3   45    male  ...           7882       42  furniture/equipment
4           4   53    male  ...           4870       24                  car
5           5   35    male  ...           9055       36            education
6           6   53    male  ...           2835       24  furniture/equipment
7           7   35    male  ...           6948       36                  car
8           8   61    male  ...           3059       12             radio/TV
9           9   28    male  ...           5234       30                  car

[10 rows x 10 columns]

1.If you find Unnamed column in the data remove that by filtering

In [0]:
df.drop("Unnamed: 0",axis=1,inplace=True)
df

   Age     Sex  Job  ... Credit amount Duration              Purpose
0   67    male    2  ...          1169        6             radio/TV
1   22  female    2  ...          5951       48             radio/TV
2   49    male    1  ...          2096       12            education
3   45    male    2  ...          7882       42  furniture/equipment
4   53    male    2  ...          4870       24                  car
5   35    male    1  ...          9055       36            education
6   53    male    2  ...          2835       24  furniture/equipment
7   35    male    3  ...          6948       36                  car
8   61    male    1  ...          3059       12             radio/TV
9   28    male    3  ...          5234       30                  car

[10 rows x 9 columns]

2.Check the total number of entries you have

In [0]:
df.shape

(10, 9)

3.Display the top seven rows and last Three rows

In [0]:
df.head(7)

   Age     Sex  Job  ... Credit amount Duration              Purpose
0   67    male    2  ...          1169        6             radio/TV
1   22  female    2  ...          5951       48             radio/TV
2   49    male    1  ...          2096       12            education
3   45    male    2  ...          7882       42  furniture/equipment
4   53    male    2  ...          4870       24                  car
5   35    male    1  ...          9055       36            education
6   53    male    2  ...          2835       24  furniture/equipment

[7 rows x 9 columns]

In [0]:
df.tail(3)

   Age   Sex  Job Housing  ... Checking account Credit amount  Duration   Purpose
7   35  male    3    rent  ...         moderate          6948        36       car
8   61  male    1     own  ...              NaN          3059        12  radio/TV
9   28  male    3     own  ...         moderate          5234        30       car

[3 rows x 9 columns]

4.Print the row indices of the dataframe

In [0]:
df.index

RangeIndex(start=0, stop=10, step=1)

5.Check the dtype of each and every columns

In [0]:
df.dtypes

Age                  int64
Sex                 object
Job                  int64
Housing             object
Saving accounts     object
Checking account    object
Credit amount        int64
Duration             int64
Purpose             object
dtype: object

6.Description for Numerical Column min,max,count,25%,50%,75%,std

In [0]:
df.describe()

            Age        Job  Credit amount   Duration
count  10.00000  10.000000      10.000000  10.000000
mean   44.80000   1.900000    4909.900000  27.000000
std    14.53578   0.737865    2603.480852  13.928388
min    22.00000   1.000000    1169.000000   6.000000
25%    35.00000   1.250000    2891.000000  15.000000
50%    47.00000   2.000000    5052.000000  27.000000
75%    53.00000   2.000000    6698.750000  36.000000
max    67.00000   3.000000    9055.000000  48.000000

7.Description for the categorical Columns count,top,freq

In [0]:
df.describe(include=[np.object])

         Sex Housing Saving accounts Checking account   Purpose
count     10      10               8                6        10
unique     2       3               3                2         4
top     male     own          little           little  radio/TV
freq       9       6               6                3         3

8.Missing value count column wise

In [0]:
df.isnull().sum()

Age                 0
Sex                 0
Job                 0
Housing             0
Saving accounts     2
Checking account    4
Credit amount       0
Duration            0
Purpose             0
dtype: int64

9.Access particular rows and columns using iloc,loc

In [0]:
df.iloc[ :,[0,2]]

   Age  Job
0   67    2
1   22    2
2   49    1
3   45    2
4   53    2
5   35    1
6   53    2
7   35    3
8   61    1
9   28    3

In [0]:
df.loc[[1,3], ['Age','Housing']]

   Age Housing
1   22     own
3   45    free

10.How many unique values are there in a particular column

In [0]:
print(df.Age.unique())

[67 22 49 45 53 35 61 28]

In [0]:
print(pd.unique(df['Purpose']))

['radio/TV' 'education' 'furniture/equipment' 'car']

11.Check the output for the info function

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Age               10 non-null     int64
 1   Sex               10 non-null     object
 2   Job               10 non-null     int64
 3   Housing           10 non-null     object
 4   Saving accounts   8 non-null      object
 5   Checking account  6 non-null      object
 6   Credit amount     10 non-null     int64
 7   Duration          10 non-null     int64
 8   Purpose           10 non-null     object
dtypes: int64(4), object(5)
memory usage: 848.0+ bytes

12.Check the No of features,Print features Names(Column Names)

In [0]:
print(len(df.columns))
list(df.columns)

9

['Age',
 'Sex',
 'Job',
 'Housing',
 'Saving accounts',
 'Checking account',
 'Credit amount',
 'Duration',
 'Purpose']